In [2]:
import pandas as pd
import numpy as np

In [12]:
pop = pd.Series([33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561],index=['a','b','c','d','e','f'])
pop

a    33871648
b    37253956
c    18976457
d    19378102
e    20851820
f    25145561
dtype: int64

In [16]:
index=['a','b','c','d','e','f']
pop = pd.Series([33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561],index=index)
pop
pop['a': 'c']

a    33871648
b    37253956
c    18976457
dtype: int64

In [17]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]

populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [18]:
pop[('California', 2010):('Texas', 2000)]

(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
dtype: int64

In [28]:
l = []
for i in pop.index:
    if i[1] == 2010:
        l.append(pop[i])
print(l)

[37253956, 19378102, 25145561]

In [29]:
l = [pop[i] for i in pop.index if i[1] == 2010]
l

[37253956, 19378102, 25145561]

In [33]:
pop[[('California', 2010),('New York', 2010),('Texas', 2010)]]
pop[[i for i in pop.index if i[1] == 2010]]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

In [36]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]

index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [37]:
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [38]:
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [39]:
pop[:, 2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [40]:
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [41]:
pop_sir = pop_df.stack()
pop_sir

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [42]:
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [43]:
pop_df = pd.DataFrame({'total': pop,
                       'under18': [9267089, 9284094,
                                   4687374, 4318033,
                                   5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [51]:
f_u18  = pop_df['under18']/ pop_df['total']
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

In [54]:
df = pd.DataFrame(np.random.rand(4, 2),
                  index=[['a', 'a', 'b', 'b'],[1,2,1,2]],
                  columns=['data1', 'data2'])
df

        data1     data2
a 1  0.898769  0.120486
  2  0.091982  0.845141
b 1  0.413202  0.988192
  2  0.276032  0.931984

In [56]:
pop.index.names = ['state','year' ]
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [63]:
# 계층적 인덱스와 열
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                    names=['subject', 'type'])

data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      30.0  37.2  50.0  36.9  25.0  37.3
     2      48.0  37.8  47.0  36.4  29.0  36.0
2014 1      22.0  35.7  16.0  36.7  46.0  36.5
     2      44.0  37.2  32.0  36.7  27.0  38.6

In [68]:
health_data['Guido']
health_data['Guido']['HR']
health_data['Guido','HR']

year  visit
2013  1        50.0
      2        47.0
2014  1        16.0
      2        32.0
Name: (Guido, HR), dtype: float64

In [74]:
pop
pop['California']
pop['California',2000]
pop
pop['California' : 'New York']
# 2000년도 데이터만 가지고 오시오
pop[: , 2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [79]:
# 모든 데이터에서 22000000보다 큰 데이터만 출력하시오.
pop > 22000000 # 마스크
pop[pop > 22000000] # 마스킹
# California , Texas데이터를 가지고 오시오.
pop['California'], pop['Texas']
pop[['California','Texas' ]] # 팬시 인덱싱

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

In [84]:
health_data
health_data.iloc[0:2, 0:2]
health_data
health_data.loc[: , ('Guido', 'Temp')]

year  visit
2013  1        36.9
      2        36.4
2014  1        36.7
      2        36.7
Name: (Guido, Temp), dtype: float64

In [87]:
idx = pd.IndexSlice
health_data.loc[idx[:, 1] , idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      30.0  50.0  25.0
2014 1      22.0  16.0  46.0

In [105]:
index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1, 2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.355351
      2      0.274061
c     1      0.474610
      2      0.116276
b     1      0.262809
      2      0.635166
dtype: float64

In [106]:
# index 정렬
data = data.sort_index()
data

char  int
a     1      0.355351
      2      0.274061
b     1      0.262809
      2      0.635166
c     1      0.474610
      2      0.116276
dtype: float64

In [108]:
data['a' : 'b']

char  int
a     1      0.355351
      2      0.274061
b     1      0.262809
      2      0.635166
dtype: float64

In [113]:
pop.unstack()
pop.unstack(level=0)
pop.unstack(level=1)
pop.unstack().stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [123]:
pop
pop_flat = pop.reset_index(name='population')
pop_flat
#print(type(pop_flat))
pop_ser = pop_flat.set_index(['state'	,'year'])
pop_ser
#print(type(pop_ser))

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

In [131]:
health_data
#### 각 열에 대한 년도의 평균을 구하시오.
data_mean = health_data.mean(level = 'year')
data_mean
data_mean.mean(level = 'type', axis=1)

C:\Users\SCOOL\AppData\Local\Temp\ipykernel_720\2173746977.py:3: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.median(level=1) should use df.groupby(level=1).median().
  data_mean = health_data.mean(level = 'year')
C:\Users\SCOOL\AppData\Local\Temp\ipykernel_720\2173746977.py:5: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.median(level=1) should use df.groupby(level=1).median().
  data_mean.mean(level = 'type', axis=1)

type         HR       Temp
year
2013  38.166667  36.933333
2014  31.166667  36.900000

In [130]:
health_data
health_data.mean(level = 'type', axis=1)

C:\Users\SCOOL\AppData\Local\Temp\ipykernel_720\1123710997.py:2: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.median(level=1) should use df.groupby(level=1).median().
  health_data.mean(level = 'type', axis=1)

type               HR       Temp
year visit
2013 1      35.000000  37.133333
     2      41.333333  36.733333
2014 1      28.000000  36.300000
     2      34.333333  37.500000